tests/fixtures/lis2/parse/section_assoc_replace.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <imsx_syncRequestHeaderInfo xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/cmsv1p0/wsdl11/sync/imscms_v1p0">
      <imsx_version>V1.0</imsx_version>
      <imsx_messageIdentifier>2</imsx_messageIdentifier>
    </imsx_syncRequestHeaderInfo>
  </soapenv:Header>
  <soapenv:Body>
    <replaceSectionAssociationRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/cmsv1p0/wsdl11/sync/imscms_v1p0">
      <sourcedId>messageRefID</sourcedId>
      <sectionAssociationRecord>
        <sourcedGUID>
          <refAgentInstanceID>ILP</refAgentInstanceID>
          <sourcedId>AA201740</sourcedId>
        </sourcedGUID>
        <type>meta</type>
        <sectionAssociation>
          <label>
            <language>en</language>
            <textString>LabelString</textString>
          </label>
          <title>
            <language>en</language>
            <textString>TitleString</textString>
          </title>
          <status>Active</status>
          <courseSectionIdList>
            <courseSectionId>10001.201740</courseSectionId>
            <courseSectionId>10002.201740</courseSectionId>
          </courseSectionIdList>
          <dataSource>Banner</dataSource>
        </sectionAssociation>
      </sectionAssociationRecord>
    </replaceSectionAssociationRequest>
  </soapenv:Body>
</soapenv:Envelope>